
function γ(e, V)
    return 1 + e*cos(V)
end


function get_R(model)
   model.p₃/(1 + model.e₃*cos(model.V₃ᵢ₋₁))
end

function get_p_next(model)
   (; η, ιᵢ₋₁, V₃ᵢ₋₁, Ωᵢ₋₁, ωᵢ₋₁, ω₃, eᵢ₋₁, pᵢ₋₁, m₁₂, m₃) = model

   Δp_2b = (128π/5*η*sqrt((m₁₂/pᵢ₋₁)^5))*(1 + 7/8*eᵢ₋₁^2)

   R = get_R(model)

   Δp_3b = if !iszero(m₃)
      (-15*π*(2*sin(2*ιᵢ₋₁ -2*ωᵢ₋₁) + 
       4*sin(2*ωᵢ₋₁) - 
       2*sin(2*(ιᵢ₋₁ +  ωᵢ₋₁)) - 
       4*sin(2*V₃ᵢ₋₁ - ιᵢ₋₁ -2*(ωᵢ₋₁ +   Ωᵢ₋₁ -   ω₃)) - 
       4*sin(2*V₃ᵢ₋₁ + ιᵢ₋₁ -2*(ωᵢ₋₁ +   Ωᵢ₋₁ -   ω₃)) - 
       6*sin(2*(V₃ᵢ₋₁ - ωᵢ₋₁ -  Ωᵢ₋₁ +  ω₃)) - 
       sin(2*(V₃ᵢ₋₁ - ιᵢ₋₁ - ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) - 
       sin(2*(V₃ᵢ₋₁ + ιᵢ₋₁ - ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) + 
       6*sin(2*(V₃ᵢ₋₁ + ωᵢ₋₁ -  Ωᵢ₋₁ +  ω₃)) + 
       sin(2*(V₃ᵢ₋₁ - ιᵢ₋₁ + ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) + 
       sin(2*(V₃ᵢ₋₁ + ιᵢ₋₁ + ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) - 
       4*sin(2*V₃ᵢ₋₁ - ιᵢ₋₁ + 2*(ωᵢ₋₁ -   Ωᵢ₋₁ +   ω₃)) - 
       4*sin(2*V₃ᵢ₋₁ + ιᵢ₋₁ + 2*(ωᵢ₋₁ -   Ωᵢ₋₁ +   ω₃)))*eᵢ₋₁^2*m₃*pᵢ₋₁^3)/(16*m₁₂*R^3*(1 - eᵢ₋₁^2)^(7/2)) # changed from pᵢ₋₁^4 to pᵢ₋₁^3
   else
      0.0
   end

   return pᵢ₋₁*(1 - Δp_2b + Δp_3b)
end

function get_e_next(model)
   (; η, ιᵢ₋₁, V₃ᵢ₋₁, Ωᵢ₋₁, ωᵢ₋₁, ω₃, eᵢ₋₁, pᵢ₋₁, m₁₂, m₃) = model

   R = get_R(model)

   Δe_2b = (608*π/15*η*sqrt((m₁₂/pᵢ₋₁)^5))*(1 + 121/304*eᵢ₋₁^2)

   Δe_3b = if !iszero(m₃)
      (15*π*(2*sin(2*ιᵢ₋₁ - 2*ωᵢ₋₁) + 
       4*sin(2*ωᵢ₋₁) - 
       2*sin(2*(ιᵢ₋₁ + ωᵢ₋₁)) - 
       4*sin(2*V₃ᵢ₋₁ - ιᵢ₋₁ - 2*(ωᵢ₋₁ + Ωᵢ₋₁ - ω₃)) - 
       4*sin(2*V₃ᵢ₋₁ + ιᵢ₋₁ - 2*(ωᵢ₋₁ + Ωᵢ₋₁ - ω₃)) - 
       6*sin(2*(V₃ᵢ₋₁ - ωᵢ₋₁ -Ωᵢ₋₁ + ω₃)) - 
       sin(2*(V₃ᵢ₋₁ - ιᵢ₋₁ -  ωᵢ₋₁ -  Ωᵢ₋₁ +ω₃)) - 
       sin(2*(V₃ᵢ₋₁ + ιᵢ₋₁ -  ωᵢ₋₁ -  Ωᵢ₋₁ +ω₃)) + 
       6*sin(2*(V₃ᵢ₋₁ + ωᵢ₋₁ -Ωᵢ₋₁ + ω₃)) + 
       sin(2*(V₃ᵢ₋₁ - ιᵢ₋₁ +ωᵢ₋₁ -  Ωᵢ₋₁ +ω₃)) + 
       sin(2*(V₃ᵢ₋₁ + ιᵢ₋₁ +ωᵢ₋₁ -  Ωᵢ₋₁ +ω₃)) - 
       4*sin(2*V₃ᵢ₋₁ - ιᵢ₋₁ + 2*(ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) - 
       4*sin(2*V₃ᵢ₋₁ + ιᵢ₋₁ + 2*(ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)))*m₃*pᵢ₋₁^3)/(32*m₁₂*R^3*(1 - eᵢ₋₁^2)^(5/2)) # took out eᵢ₋₁
   else
      0.0
   end

   return eᵢ₋₁*(1 - Δe_2b + Δe_3b)
end


function get_Ω_next(model)
   (; ιᵢ₋₁, V₃ᵢ₋₁, Ωᵢ₋₁, ω₃, ωᵢ₋₁, eᵢ₋₁, pᵢ₋₁, m₁₂, m₃) = model

   R = get_R(model)

   ΔΩ = if !iszero(m₃)
      (3*π*sin(V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃)*(-8*cos(ιᵢ₋₁)*
      sin(V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃) + 
      (-6*sin(V₃ᵢ₋₁ - ιᵢ₋₁ - Ωᵢ₋₁ + ω₃) - 
      6*sin(V₃ᵢ₋₁ + ιᵢ₋₁ - Ωᵢ₋₁ + ω₃) + 
      5*(2*sin(V₃ᵢ₋₁ - 2*ωᵢ₋₁ - Ωᵢ₋₁ + ω₃) + 
      sin(V₃ᵢ₋₁ - ιᵢ₋₁ - 2*ωᵢ₋₁ - Ωᵢ₋₁ + ω₃) + 
      sin(V₃ᵢ₋₁ + ιᵢ₋₁ - 2*ωᵢ₋₁ - Ωᵢ₋₁ + ω₃) - 
      2*sin(V₃ᵢ₋₁ + 2*ωᵢ₋₁ - Ωᵢ₋₁ + ω₃) + 
      sin(V₃ᵢ₋₁ - ιᵢ₋₁ + 2*ωᵢ₋₁ - Ωᵢ₋₁ + ω₃) + 
      sin(V₃ᵢ₋₁ + ιᵢ₋₁ + 2*ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)))*eᵢ₋₁^2)*m₃*pᵢ₋₁^3)/(8*m₁₂*R^3*(1 - eᵢ₋₁^2)^(7/2))
   else
      0.0
   end

   return Ωᵢ₋₁ + ΔΩ
end

function get_ω_next(model)
   (; ιᵢ₋₁, V₃ᵢ₋₁, ωᵢ₋₁, Ωᵢ₋₁, ω₃, eᵢ₋₁, pᵢ₋₁, m₃, m₁₂) = model

   R = get_R(model)

   Δω = if !iszero(m₃) 
      (3*π*(12 + 20*cos(2*ιᵢ₋₁) - 
       10*cos(2*ιᵢ₋₁ - 2*ωᵢ₋₁) + 
       20*cos(2*ωᵢ₋₁) - 
       10*cos(2*(ιᵢ₋₁ + ωᵢ₋₁)) + 
       20*cos(2*V₃ᵢ₋₁ - ιᵢ₋₁ - 2*(ωᵢ₋₁ + Ωᵢ₋₁ - ω₃)) + 
       20*cos(2*V₃ᵢ₋₁ + ιᵢ₋₁ - 2*(ωᵢ₋₁ + Ωᵢ₋₁ - ω₃)) + 
       4*cos(2*(V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃)) - 
       10*cos(2*(V₃ᵢ₋₁ - ιᵢ₋₁ -Ωᵢ₋₁ + ω₃)) - 
       10*cos(2*(V₃ᵢ₋₁ + ιᵢ₋₁ -Ωᵢ₋₁ + ω₃)) + 
       30*cos(2*(V₃ᵢ₋₁ - ωᵢ₋₁ -Ωᵢ₋₁ + ω₃)) + 
       5*cos(2*(V₃ᵢ₋₁ - ιᵢ₋₁ -ωᵢ₋₁ -Ωᵢ₋₁ + ω₃)) + 
       5*cos(2*(V₃ᵢ₋₁ + ιᵢ₋₁ -ωᵢ₋₁ -Ωᵢ₋₁ + ω₃)) + 
       30*cos(2*(V₃ᵢ₋₁ + ωᵢ₋₁ -Ωᵢ₋₁ + ω₃)) + 
       5*cos(2*(V₃ᵢ₋₁ - ιᵢ₋₁ + ωᵢ₋₁ -Ωᵢ₋₁ + ω₃)) + 
       5*cos(2*(V₃ᵢ₋₁ + ιᵢ₋₁ + ωᵢ₋₁ -Ωᵢ₋₁ + ω₃)) - 
       20*cos(2*V₃ᵢ₋₁ - ιᵢ₋₁ + 2*(ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) - 
       20*cos(2*V₃ᵢ₋₁ + ιᵢ₋₁ + 2*(ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) - 
       2*(-4 + 20*cos(2*ωᵢ₋₁) + 5*cos(2*V₃ᵢ₋₁ - ιᵢ₋₁ - 2*(ωᵢ₋₁ +    Ωᵢ₋₁ -    ω₃)) + 
       5*cos(2*V₃ᵢ₋₁ + ιᵢ₋₁ - 2*(ωᵢ₋₁ +    Ωᵢ₋₁ -    ω₃)) + 
       12*cos(2*(V₃ᵢ₋₁ -   Ωᵢ₋₁ +   ω₃)) + 
       10*cos(2*(V₃ᵢ₋₁ - ωᵢ₋₁ -   Ωᵢ₋₁ +   ω₃)) + 
       10*cos(2*(V₃ᵢ₋₁ + ωᵢ₋₁ -   Ωᵢ₋₁ +   ω₃)) - 
       5*cos(2*V₃ᵢ₋₁ - ιᵢ₋₁ + 2*(ωᵢ₋₁ -    Ωᵢ₋₁ +    ω₃)) - 
       5*cos(2*V₃ᵢ₋₁ + ιᵢ₋₁ + 2*(ωᵢ₋₁ -    Ωᵢ₋₁ +    ω₃)))*eᵢ₋₁^2)*m₃*pᵢ₋₁^3)/(32*m₁₂*R^3*(1 - eᵢ₋₁^2)^(7/2))
    else
      0.0
    end
   
   return ωᵢ₋₁ + Δω
end

function get_ι_next(model)
   (; ιᵢ₋₁, V₃ᵢ₋₁, Ωᵢ₋₁, ω₃, ωᵢ₋₁, eᵢ₋₁, pᵢ₋₁, m₃, m₁₂) = model

   R = get_R(model)

   Δi = if !iszero(m₃)
      (-3*π*sin(ιᵢ₋₁)*
      sin(V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃)*
      (8*cos(V₃ᵢ₋₁ - Ωᵢ₋₁ +ω₃) + 
      (12*cos(V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃) + 
      5*(2*cos(V₃ᵢ₋₁ - 2*ωᵢ₋₁ - Ωᵢ₋₁ + ω₃) + 
      cos(V₃ᵢ₋₁ - ιᵢ₋₁ - 2*ωᵢ₋₁ - Ωᵢ₋₁ + ω₃) + 
      cos(V₃ᵢ₋₁ + ιᵢ₋₁ - 2*ωᵢ₋₁ - Ωᵢ₋₁ + ω₃) + 
      2*cos(V₃ᵢ₋₁ + 2*ωᵢ₋₁ - Ωᵢ₋₁ + ω₃) - 
      cos(V₃ᵢ₋₁ - ιᵢ₋₁ + 2*ωᵢ₋₁ - Ωᵢ₋₁ + ω₃) - 
      cos(V₃ᵢ₋₁ + ιᵢ₋₁ + 2*ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)))*eᵢ₋₁^2)*m₃*pᵢ₋₁^3)/(8*m₁₂*R^3*(1 - eᵢ₋₁^2)^(7/2))
   else
      0.0
   end

   return ιᵢ₋₁ + Δi
end

function get_V₃ᵢ₋₁_next(model)
   (; V₃ᵢ₋₁, sqrt_Mp₃⁻³, e₃, t, tᵢ₋₁) = model

    return V₃ᵢ₋₁ + sqrt_Mp₃⁻³*γ(e₃, V₃ᵢ₋₁)^2*(t - tᵢ₋₁)
end

function get_t_next(model)
   (; ιᵢ₋₁, Ωᵢ₋₁, ω₃, ωᵢ₋₁, eᵢ₋₁, pᵢ₋₁, m₃, η, m₁₂, V₃ᵢ₋₁) = model
   
   Acoeff = Utils.get_Acoeff(η, pᵢ₋₁, m₁₂, eᵢ₋₁)
   Bcoeff = Utils.get_Bcoeff(eᵢ₋₁)

   R = get_R(model)

   Δt_2b = 2π/√m₁₂*sqrt((pᵢ₋₁ + η*sqrt(m₁₂^5/pᵢ₋₁^3)*Acoeff) / 
                   (1 - eᵢ₋₁^2 + η*sqrt((m₁₂/pᵢ₋₁)^5)*Bcoeff))^3

                   
   Δt_3b = if !iszero(m₃)
   # fac = -1/128*(π*(-256*m₁₂ + 768*m₁₂*eᵢ₋₁^2 - 768*m₁₂*eᵢ₋₁^4 + 256*m₁₂*eᵢ₋₁^6)*sqrt(pᵢ₋₁^3/m₁₂))/(m₁₂*(1 - eᵢ₋₁^2)^(9/2))
   # tmp = -1/128*(π*sqrt(pᵢ₋₁^3/m₁₂)*
   #    (-768*m₁₂*R^3*eᵢ₋₁^4 + 256*m₁₂*R^3*eᵢ₋₁^6 + 3*eᵢ₋₁^2*
   #     (256*m₁₂*R^3 - (20 + 60*cos(2*ιᵢ₋₁) - 
   #            34*cos(2*ιᵢ₋₁ - 2*ωᵢ₋₁) + 
   #            68*cos(2*ωᵢ₋₁) - 
   #            34*cos(2*(ιᵢ₋₁ + ωᵢ₋₁)) + 
   #            68*cos(2*V₃ᵢ₋₁ - ιᵢ₋₁ - 2*(ωᵢ₋₁ + Ωᵢ₋₁ - ω₃)) + 
   #            68*cos(2*V₃ᵢ₋₁ + ιᵢ₋₁ - 2*(ωᵢ₋₁ + Ωᵢ₋₁ - ω₃)) + 
   #            60*cos(2*(V₃ᵢ₋₁ -Ωᵢ₋₁ + ω₃)) - 
   #            30*cos(2*(V₃ᵢ₋₁ - ιᵢ₋₁ -Ωᵢ₋₁ + ω₃)) - 
   #            30*cos(2*(V₃ᵢ₋₁ + ιᵢ₋₁ -Ωᵢ₋₁ + ω₃)) + 
   #            102*cos(2*(V₃ᵢ₋₁ - ωᵢ₋₁ -Ωᵢ₋₁ + ω₃)) + 
   #            17*cos(2*(V₃ᵢ₋₁ - ιᵢ₋₁ -ωᵢ₋₁ -Ωᵢ₋₁ + ω₃)) + 
   #            17*cos(2*(V₃ᵢ₋₁ + ιᵢ₋₁ -ωᵢ₋₁ -Ωᵢ₋₁ + ω₃)) + 
   #            102*cos(2*(V₃ᵢ₋₁ + ωᵢ₋₁ -Ωᵢ₋₁ + ω₃)) + 
   #            17*cos(2*(V₃ᵢ₋₁ - ιᵢ₋₁ + ωᵢ₋₁ -Ωᵢ₋₁ + ω₃)) + 
   #            17*cos(2*(V₃ᵢ₋₁ + ιᵢ₋₁ + ωᵢ₋₁ -Ωᵢ₋₁ + ω₃)) - 
   #            68*cos(2*V₃ᵢ₋₁ - ιᵢ₋₁ + 2*(ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) - 
   #            68*cos(2*V₃ᵢ₋₁ + ιᵢ₋₁ + 2*(ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)))*m₃*pᵢ₋₁^3) - 
   #      8*(32*m₁₂*R^3 + (10 + 30*cos(2*ιᵢ₋₁) - 
   #            24*cos(2*ιᵢ₋₁ - 2*ωᵢ₋₁) + 
   #            48*cos(2*ωᵢ₋₁) - 
   #            24*cos(2*(ιᵢ₋₁ + ωᵢ₋₁)) + 
   #            48*cos(2*V₃ᵢ₋₁ - ιᵢ₋₁ - 2*(ωᵢ₋₁ + Ωᵢ₋₁ - ω₃)) + 
   #            48*cos(2*V₃ᵢ₋₁ + ιᵢ₋₁ - 2*(ωᵢ₋₁ + Ωᵢ₋₁ - ω₃)) + 
   #            30*cos(2*(V₃ᵢ₋₁ -Ωᵢ₋₁ + ω₃)) - 
   #            15*cos(2*(V₃ᵢ₋₁ - ιᵢ₋₁ -Ωᵢ₋₁ + ω₃)) - 
   #            15*cos(2*(V₃ᵢ₋₁ + ιᵢ₋₁ -Ωᵢ₋₁ + ω₃)) + 
   #            72*cos(2*(V₃ᵢ₋₁ - ωᵢ₋₁ -Ωᵢ₋₁ + ω₃)) + 
   #            12*cos(2*(V₃ᵢ₋₁ - ιᵢ₋₁ -ωᵢ₋₁ -Ωᵢ₋₁ + ω₃)) + 
   #            12*cos(2*(V₃ᵢ₋₁ + ιᵢ₋₁ -ωᵢ₋₁ -Ωᵢ₋₁ + ω₃)) + 
   #            72*cos(2*(V₃ᵢ₋₁ + ωᵢ₋₁ -Ωᵢ₋₁ + ω₃)) + 
   #            12*cos(2*(V₃ᵢ₋₁ - ιᵢ₋₁ + ωᵢ₋₁ -Ωᵢ₋₁ + ω₃)) + 
   #            12*cos(2*(V₃ᵢ₋₁ + ιᵢ₋₁ + ωᵢ₋₁ -Ωᵢ₋₁ + ω₃)) - 
   #            48*cos(2*V₃ᵢ₋₁ - ιᵢ₋₁ + 2*(ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) - 
   #            48*cos(2*V₃ᵢ₋₁ + ιᵢ₋₁ + 2*(ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)))*m₃*pᵢ₋₁^3)))/(m₁₂*R^3*(1 - eᵢ₋₁^2)^(9/2))
   #    tmp/(fac*2π)
      (-768*m₁₂*R^3*eᵢ₋₁^4 + 256*m₁₂*R^3*eᵢ₋₁^6 +3*eᵢ₋₁^2*(256*m₁₂*R^3 - 
      (20 + 60*cos(2*ιᵢ₋₁) - 34*cos(2*ιᵢ₋₁ - 2*ωᵢ₋₁) + 68*cos(2*ωᵢ₋₁) - 
      34*cos(2*(ιᵢ₋₁ + ωᵢ₋₁)) +68*cos(2*V₃ᵢ₋₁ - ιᵢ₋₁ - 2*(ωᵢ₋₁ + Ωᵢ₋₁ - ω₃)) + 
      68*cos(2*V₃ᵢ₋₁ + ιᵢ₋₁ - 2*(ωᵢ₋₁ + Ωᵢ₋₁ - ω₃)) +60*cos(2*(V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃)) - 
      30*cos(2*(V₃ᵢ₋₁ - ιᵢ₋₁ - Ωᵢ₋₁ + ω₃)) -30*cos(2*(V₃ᵢ₋₁ + ιᵢ₋₁ - Ωᵢ₋₁ + ω₃)) + 
      102*cos(2*(V₃ᵢ₋₁ - ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) +17*cos(2*(V₃ᵢ₋₁ - ιᵢ₋₁ - ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) + 
      17*cos(2*(V₃ᵢ₋₁ + ιᵢ₋₁ - ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) +102*cos(2*(V₃ᵢ₋₁ + ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) + 
      17*cos(2*(V₃ᵢ₋₁ - ιᵢ₋₁ + ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) +17*cos(2*(V₃ᵢ₋₁ + ιᵢ₋₁ + ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) - 
      68*cos(2*V₃ᵢ₋₁ - ιᵢ₋₁ + 2*(ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) - 
      68*cos(2*V₃ᵢ₋₁ + ιᵢ₋₁ + 2*(ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)))*m₃*pᵢ₋₁^3) - 
      8*(32*m₁₂*R^3 + (10 + 30*cos(2*ιᵢ₋₁) - 24*cos(2*ιᵢ₋₁ - 2*ωᵢ₋₁) + 
      48*cos(2*ωᵢ₋₁) -24*cos(2*(ιᵢ₋₁ + ωᵢ₋₁)) +48*cos(2*V₃ᵢ₋₁ - ιᵢ₋₁ - 2*(ωᵢ₋₁ + Ωᵢ₋₁ - ω₃)) + 
      48*cos(2*V₃ᵢ₋₁ + ιᵢ₋₁ - 2*(ωᵢ₋₁ + Ωᵢ₋₁ - ω₃)) + 
      30*cos(2*(V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃)) - 
      15*cos(2*(V₃ᵢ₋₁ - ιᵢ₋₁ - Ωᵢ₋₁ + ω₃)) -15*cos(2*(V₃ᵢ₋₁ + ιᵢ₋₁ - Ωᵢ₋₁ + ω₃)) + 
      72*cos(2*(V₃ᵢ₋₁ - ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) +12*cos(2*(V₃ᵢ₋₁ - ιᵢ₋₁ - ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) + 
      12*cos(2*(V₃ᵢ₋₁ + ιᵢ₋₁ - ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) +72*cos(2*(V₃ᵢ₋₁ + ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) + 
      12*cos(2*(V₃ᵢ₋₁ - ιᵢ₋₁ + ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) +12*cos(2*(V₃ᵢ₋₁ + ιᵢ₋₁ + ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) - 
      48*cos(2*V₃ᵢ₋₁ - ιᵢ₋₁ + 2*(ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) - 
      48*cos(2*V₃ᵢ₋₁ + ιᵢ₋₁ + 2*(ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)))*m₃*pᵢ₋₁^3))/(R^3*(-256*m₁₂ + 768*m₁₂*eᵢ₋₁^2 - 768*m₁₂*eᵢ₋₁^4 + 256*m₁₂*eᵢ₋₁^6))
   else
      0.0
   end

   # println(Δt_3b)

   # return model.tᵢ₋₁ + Δt_2b*(1 + Δt_3b)
   # return model.tᵢ₋₁ + (Δt_2b*Δt_3b)
   return model.tᵢ₋₁ + Δt_2b + Δt_3b
end

function get_V3_next(model)
    return model.V₃ᵢ₋₁ + model.sqrt_Mp₃⁻³*(γ(model.e₃, model.V₃ᵢ₋₁)^2*(model.t[end] - model.tᵢ₋₁))
end