const m₁₂ = 1

function γ(e, V)
    return 1 + e * cos(V)
end

# ============================================= #

function get_R(model)
    return model.p₃ / (1 + model.e₃ * cos(model.V₃ᵢ₋₁))
end

function get_R(p₃, e₃, V₃ᵢ₋₁)
    return p₃ / (1 + e₃ * cos(V₃ᵢ₋₁))
end

function get_p_next(η, ιᵢ₋₁, V₃ᵢ₋₁, Ωᵢ₋₁, ωᵢ₋₁, ω₃, eᵢ₋₁, pᵢ₋₁, m₃, R)

    Δp_2b = (128π / 5 * η * sqrt((m₁₂ / pᵢ₋₁)^5)) * (1 + 7 / 8 * eᵢ₋₁^2)


    Δp_3b = if !iszero(m₃)
        # (
        #     -15 * π * (
        #         sin(2 * ωᵢ₋₁) * (
        #             1 + 3 * cos(2 * (V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃)) -
        #                 2 * cos(2 * ιᵢ₋₁) * sin(V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃)^2
        #         ) -
        #             4 * cos(ιᵢ₋₁) * cos(2 * ωᵢ₋₁) * sin(2 * (V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃))
        #     ) * eᵢ₋₁^2 * m₃ * pᵢ₋₁^3
        # ) / (4 * m₁₂ * R^3 * sqrt(1 - eᵢ₋₁^2)^7)
        (-30 * eᵢ₋₁^2 * pᵢ₋₁^3 * π * (cos(Ωᵢ₋₁ - V₃ᵢ₋₁ - ω₃) * sin(ωᵢ₋₁) + cos(ιᵢ₋₁) * 
        cos(ωᵢ₋₁) * sin(Ωᵢ₋₁ - V₃ᵢ₋₁ - ω₃)) * (cos(ωᵢ₋₁) * cos(Ωᵢ₋₁ - V₃ᵢ₋₁ - ω₃) - 
        cos(ιᵢ₋₁) * sin(ωᵢ₋₁) * sin(Ωᵢ₋₁ - V₃ᵢ₋₁ - ω₃)) * m₃) / (sqrt(1 - eᵢ₋₁^2)^7 * m₁₂ * R^3)

    else
        0.0
    end

    return pᵢ₋₁ * (1 - Δp_2b + Δp_3b)
end

function get_e_next(η, ιᵢ₋₁, V₃ᵢ₋₁, Ωᵢ₋₁, ωᵢ₋₁, ω₃, eᵢ₋₁, pᵢ₋₁, m₃, R)

    Δe_2b = (608 * π / 15 * η * sqrt((m₁₂ / pᵢ₋₁)^5)) * (1 + 121 / 304 * eᵢ₋₁^2)

    Δe_3b = if !iszero(m₃)
        # (
        #     15 * π * (
        #         sin(2 * ωᵢ₋₁) * (
        #             1 + 3 * cos(2 * (V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃)) -
        #                 2 * cos(2 * ιᵢ₋₁) * sin(V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃)^2
        #         ) -
        #             4 * cos(ιᵢ₋₁) * cos(2 * ωᵢ₋₁) * sin(2 * (V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃))
        #     ) * m₃ * pᵢ₋₁^3
        # ) / (8 * m₁₂ * R^3 * sqrt(1 - eᵢ₋₁^2)^5)
        (15 * pᵢ₋₁^3 * π * (cos(Ωᵢ₋₁ - V₃ᵢ₋₁ - ω₃) * sin(ωᵢ₋₁) + cos(ιᵢ₋₁) * cos(ωᵢ₋₁) * 
        sin(Ωᵢ₋₁ - V₃ᵢ₋₁ - ω₃)) * (cos(ωᵢ₋₁) * cos(Ωᵢ₋₁ - V₃ᵢ₋₁ - ω₃) - 
        cos(ιᵢ₋₁) * sin(ωᵢ₋₁) * sin(Ωᵢ₋₁ - V₃ᵢ₋₁ - ω₃)) * m₃) / (sqrt(1 - eᵢ₋₁^2)^5 * m₁₂ * R^3)

    else
        0.0
    end


    # println(Δe_3b)

    return eᵢ₋₁ * (1 - Δe_2b + Δe_3b)
end


function get_Ω_next(η, ιᵢ₋₁, V₃ᵢ₋₁, Ωᵢ₋₁, ωᵢ₋₁, ω₃, eᵢ₋₁, pᵢ₋₁, m₃, R)

    ΔΩ = if !iszero(m₃)
        # (
        #     -3 * π * (
        #         4 * cos(ιᵢ₋₁) * sin(V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃)^2 +
        #             (
        #             2 * cos(ιᵢ₋₁) * (3 - 5 * cos(2 * ωᵢ₋₁)) * sin(V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃)^2 +
        #                 5 * sin(2 * ωᵢ₋₁) * sin(2 * (V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃))
        #         ) * eᵢ₋₁^2
        #     ) * m₃ * pᵢ₋₁^3
        # ) / (4 * m₁₂ * R^3 * sqrt(1 - eᵢ₋₁^2)^7)
        (-3 * pᵢ₋₁^3 * π * (-5 * eᵢ₋₁^2 * sin(2 * ωᵢ₋₁) * sin(2 * Ωᵢ₋₁ - 2 * V₃ᵢ₋₁ - 2 * ω₃) + 
        2 * cos(ιᵢ₋₁) * (2 + 3 * eᵢ₋₁^2 - 5 * eᵢ₋₁^2 * cos(2 * ωᵢ₋₁)) * sin(Ωᵢ₋₁ - V₃ᵢ₋₁ - ω₃)^2) * m₃) / (4 * sqrt(1 - eᵢ₋₁^2)^7 * m₁₂ * R^3)

    else
        0.0
    end

    return Ωᵢ₋₁ + ΔΩ
end

function get_ω_next(η, ιᵢ₋₁, V₃ᵢ₋₁, Ωᵢ₋₁, ωᵢ₋₁, ω₃, eᵢ₋₁, pᵢ₋₁, m₃, R)


    Δω = if !iszero(m₃)
        # (
        #     3 * π * (
        #         6 + 10 * cos(2 * ιᵢ₋₁) - 5 * cos(2 * ιᵢ₋₁ - 2 * ωᵢ₋₁) +
        #             10 * cos(2 * ωᵢ₋₁) - 5 * cos(2 * (ιᵢ₋₁ + ωᵢ₋₁)) +
        #             10 * cos(2 * V₃ᵢ₋₁ - ιᵢ₋₁ - 2 * (ωᵢ₋₁ + Ωᵢ₋₁ - ω₃)) +
        #             10 * cos(2 * V₃ᵢ₋₁ + ιᵢ₋₁ - 2 * (ωᵢ₋₁ + Ωᵢ₋₁ - ω₃)) +
        #             15 * cos(2 * (V₃ᵢ₋₁ - ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) +
        #             5 * (3 - 4 * cos(ιᵢ₋₁)) * cos(2 * (V₃ᵢ₋₁ + ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) +
        #             2 * cos(2 * (V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃)) * (1 - 10 * cos(2 * ιᵢ₋₁) * sin(ωᵢ₋₁)^2) -
        #             (
        #             -4 + 20 * cos(2 * ωᵢ₋₁) + 5 * cos(2 * V₃ᵢ₋₁ - ιᵢ₋₁ - 2 * (ωᵢ₋₁ + Ωᵢ₋₁ - ω₃)) +
        #                 5 * cos(2 * V₃ᵢ₋₁ + ιᵢ₋₁ - 2 * (ωᵢ₋₁ + Ωᵢ₋₁ - ω₃)) + 12 * cos(2 * (V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃)) +
        #                 10 * cos(2 * (V₃ᵢ₋₁ - ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) -
        #                 10 * (-1 + cos(ιᵢ₋₁)) * cos(2 * (V₃ᵢ₋₁ + ωᵢ₋₁ - Ωᵢ₋₁ + ω₃))
        #         ) * eᵢ₋₁^2
        #     ) * m₃ * pᵢ₋₁^3
        # ) / (16 * m₁₂ * R^3 * sqrt(1 - eᵢ₋₁^2)^7)
        (-3 * pᵢ₋₁^3 * π * (-6 - 4 * eᵢ₋₁^2 - 10 * cos(2 * ιᵢ₋₁) + 5 * cos(2 * ιᵢ₋₁ - 2 * ωᵢ₋₁) + 
        5 * cos(2 * (ιᵢ₋₁ + ωᵢ₋₁)) - 2 * cos(2 * Ωᵢ₋₁ - 2 * V₃ᵢ₋₁ - 2 * ω₃) + 
        12 * eᵢ₋₁^2 * cos(2 * Ωᵢ₋₁ - 2 * V₃ᵢ₋₁ - 2 * ω₃) + 10 * cos(2 * ωᵢ₋₁) * (-1 + 2 * eᵢ₋₁^2 - 
        (3 - 2 * eᵢ₋₁^2 + cos(2 * ιᵢ₋₁)) * cos(2 * Ωᵢ₋₁ - 2 * V₃ᵢ₋₁ - 2 * ω₃)) + 
        5 * cos(2 * (ιᵢ₋₁ + Ωᵢ₋₁ - V₃ᵢ₋₁ - ω₃)) + 5 * cos(2 * (ιᵢ₋₁ - Ωᵢ₋₁ + V₃ᵢ₋₁ + ω₃)) - 
        20 * (-2 + eᵢ₋₁^2) * cos(ιᵢ₋₁) * sin(2 * ωᵢ₋₁) * sin(2 * Ωᵢ₋₁ - 2 * V₃ᵢ₋₁ - 2 * ω₃)) * m₃) / (16 * sqrt(1 - eᵢ₋₁^2)^7 * m₁₂ * R^3)

    else
        0.0
    end

    return ωᵢ₋₁ + Δω
end

function get_ι_next(η, ιᵢ₋₁, V₃ᵢ₋₁, Ωᵢ₋₁, ωᵢ₋₁, ω₃, eᵢ₋₁, pᵢ₋₁, m₃, R)

    Δi = if !iszero(m₃)
        # (
        #     -3 * π * (
        #         2 * sin(ιᵢ₋₁) * sin(2 * (V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃)) +
        #             (
        #             5 * sin(2 * ιᵢ₋₁) * sin(2 * ωᵢ₋₁) * sin(V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃)^2 +
        #                 (3 + 5 * cos(2 * ωᵢ₋₁)) * sin(ιᵢ₋₁) * sin(2 * (V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃))
        #         ) * eᵢ₋₁^2
        #     ) * m₃ * pᵢ₋₁^3
        # ) / (4 * m₁₂ * R^3 * sqrt(1 - eᵢ₋₁^2)^7)
        (-3 * pᵢ₋₁^3 * π * (-((2 + 3 * eᵢ₋₁^2 + 5 * eᵢ₋₁^2 * cos(2 * ωᵢ₋₁)) * sin(ιᵢ₋₁) * sin(2 * Ωᵢ₋₁ - 2 * V₃ᵢ₋₁ - 2 * ω₃)) + 
        5 * eᵢ₋₁^2 * sin(2 * ιᵢ₋₁) * sin(2 * ωᵢ₋₁) * sin(Ωᵢ₋₁ - V₃ᵢ₋₁ - ω₃)^2) * m₃) / (4 * sqrt(1 - eᵢ₋₁^2)^7 * m₁₂ * R^3)

    else
        0.0
    end

    return ιᵢ₋₁ + Δi
end

function get_t_next_implicit(η, ιᵢ, V₃ᵢ, Ωᵢ, ωᵢ, ω₃, eᵢ, pᵢ, m₃, R, tᵢ₋₁)


    Δt_2b = 2π / √m₁₂ * √((pᵢ/(1 - eᵢ^2))^3)

    Δt_3b = if !iszero(m₃)
        # 1 - (
        #     (
        #         8 * (
        #             5 - 12 * cos(2 * ι_next - 2 * ω_next) - 12 * cos(2 * (ι_next + ω_next)) +
        #                 24 * cos(2 * ω_next) * (1 + 3 * cos(2 * (V₃_next - Ω_next + ω₃))) +
        #                 3 * cos(2 * ι_next) * (5 + 8 * cos(2 * ω_next) * cos(2 * (V₃_next - Ω_next + ω₃))) +
        #                 30 * cos(2 * (V₃_next - Ω_next + ω₃)) * sin(ι_next)^2 +
        #                 96 * cos(ι_next) * sin(2 * ω_next) * sin(2 * (V₃_next - Ω_next + ω₃))
        #         ) +
        #             3 * (
        #             10 - 17 * cos(2 * ι_next - 2 * ω_next) - 17 * cos(2 * (ι_next + ω_next)) +
        #                 34 * cos(2 * ω_next) * (1 + 3 * cos(2 * (V₃_next - Ω_next + ω₃))) +
        #                 cos(2 * ι_next) * (30 + 34 * cos(2 * ω_next) * cos(2 * (V₃_next - Ω_next + ω₃))) +
        #                 60 * cos(2 * (V₃_next - Ω_next + ω₃)) * sin(ι_next)^2 +
        #                 136 * cos(ι_next) * sin(2 * ω_next) * sin(2 * (V₃_next - Ω_next + ω₃))
        #         ) * e_next^2
        #     ) * m₃ * p_next^3
        # ) / (128 * m₁₂ * R^3 * (e_next^2 - 1)^3)
        1 - (pᵢ^3 * (80 + 60 * eᵢ^2 + 60 * (4 + 3 * eᵢ^2) * cos(2 * ιᵢ) - 
        6 * (32 + 17 * eᵢ^2) * cos(2 * ιᵢ - 2 * ωᵢ) - 192 * cos(2 * (ιᵢ + ωᵢ)) + 
        96 * cos(2 * Ωᵢ - 2 * V₃ᵢ - 2 * ω₃) * (4 * (3 + cos(2 * ιᵢ)) * cos(2 * ωᵢ) + 
        5 * sin(ιᵢ)^2) - 1536 * cos(ιᵢ) * sin(2 * ωᵢ) * sin(2 * Ωᵢ - 2 * V₃ᵢ - 2 * ω₃) + 
        3 * (4 * (32 + 17 * eᵢ^2) * cos(2 * ωᵢ) + eᵢ^2 * (-34 * cos(2 * (ιᵢ + ωᵢ)) + 
        4 * cos(2 * Ωᵢ - 2 * V₃ᵢ - 2 * ω₃) * (17 * (3 + cos(2 * ιᵢ)) * cos(2 * ωᵢ) + 
        30 * sin(ιᵢ)^2) - 272 * cos(ιᵢ) * sin(2 * ωᵢ) * sin(2 * Ωᵢ - 2 * V₃ᵢ - 2 * ω₃)))) * m₃) / (256 * (eᵢ^2 - 1)^3 * m₁₂ * R^3)


    else
        1.0
    end

    return tᵢ₋₁ + Δt_2b * Δt_3b
end

function get_t_next_explicit(η, ιᵢ₋₁, V₃ᵢ₋₁, Ωᵢ₋₁, ωᵢ₋₁, ω₃, eᵢ₋₁, pᵢ₋₁, m₃, R, tᵢ₋₁)

    Acoeff = Utils.get_Acoeff(η, pᵢ₋₁, eᵢ₋₁, m₁₂)
    Bcoeff = Utils.get_Bcoeff(eᵢ₋₁)

    Δt_2b = 2π / √m₁₂ * sqrt(
         (pᵢ₋₁ + η * √(m₁₂^5 / pᵢ₋₁^3) * Acoeff) /
         (1 - eᵢ₋₁^2 + η * √((m₁₂ / pᵢ₋₁)^5) * Bcoeff)
        )^3


    Δt_3b = if !iszero(m₃)
        # 1 - (
        #     (
        #         8 * (
        #             5 - 12 * cos(2 * ιᵢ₋₁ - 2 * ωᵢ₋₁) - 12 * cos(2 * (ιᵢ₋₁ + ωᵢ₋₁)) +
        #                 24 * cos(2 * ωᵢ₋₁) * (1 + 3 * cos(2 * (V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃))) +
        #                 3 * cos(2 * ιᵢ₋₁) * (5 + 8 * cos(2 * ωᵢ₋₁) * cos(2 * (V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃))) +
        #                 30 * cos(2 * (V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃)) * sin(ιᵢ₋₁)^2 +
        #                 96 * cos(ιᵢ₋₁) * sin(2 * ωᵢ₋₁) * sin(2 * (V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃))
        #         ) +
        #             3 * (
        #             10 - 17 * cos(2 * ιᵢ₋₁ - 2 * ωᵢ₋₁) - 17 * cos(2 * (ιᵢ₋₁ + ωᵢ₋₁)) +
        #                 34 * cos(2 * ωᵢ₋₁) * (1 + 3 * cos(2 * (V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃))) +
        #                 cos(2 * ιᵢ₋₁) * (30 + 34 * cos(2 * ωᵢ₋₁) * cos(2 * (V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃))) +
        #                 60 * cos(2 * (V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃)) * sin(ιᵢ₋₁)^2 +
        #                 136 * cos(ιᵢ₋₁) * sin(2 * ωᵢ₋₁) * sin(2 * (V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃))
        #         ) * eᵢ₋₁^2
        #     ) * m₃ * pᵢ₋₁^3
        # ) / (128 * m₁₂ * R^3 * (eᵢ₋₁^2 - 1)^3)
        1 - (pᵢ₋₁^3 * (80 + 60 * eᵢ₋₁^2 + 60 * (4 + 3 * eᵢ₋₁^2) * cos(2 * ιᵢ₋₁) - 
        6 * (32 + 17 * eᵢ₋₁^2) * cos(2 * ιᵢ₋₁ - 2 * ωᵢ₋₁) - 192 * cos(2 * (ιᵢ₋₁ + ωᵢ₋₁)) + 
        96 * cos(2 * Ωᵢ₋₁ - 2 * V₃ᵢ₋₁ - 2 * ω₃) * (4 * (3 + cos(2 * ιᵢ₋₁)) * cos(2 * ωᵢ₋₁) + 
        5 * sin(ιᵢ₋₁)^2) - 1536 * cos(ιᵢ₋₁) * sin(2 * ωᵢ₋₁) * sin(2 * Ωᵢ₋₁ - 2 * V₃ᵢ₋₁ - 2 * ω₃) + 
        3 * (4 * (32 + 17 * eᵢ₋₁^2) * cos(2 * ωᵢ₋₁) + eᵢ₋₁^2 * (-34 * cos(2 * (ιᵢ₋₁ + ωᵢ₋₁)) + 
        4 * cos(2 * Ωᵢ₋₁ - 2 * V₃ᵢ₋₁ - 2 * ω₃) * (17 * (3 + cos(2 * ιᵢ₋₁)) * cos(2 * ωᵢ₋₁) + 
        30 * sin(ιᵢ₋₁)^2) - 272 * cos(ιᵢ₋₁) * sin(2 * ωᵢ₋₁) * sin(2 * Ωᵢ₋₁ - 2 * V₃ᵢ₋₁ - 2 * ω₃)))) * m₃) / (256 * (eᵢ₋₁^2 - 1)^3 * m₁₂ * R^3)

    else
        1.0
    end

    return tᵢ₋₁ + Δt_2b * Δt_3b
end

function get_V3_next(sqrt_Mp₃⁻³, e₃, V₃ᵢ₋₁, t, tᵢ₋₁)
    return V₃ᵢ₋₁ + sqrt_Mp₃⁻³ * (γ(e₃, V₃ᵢ₋₁)^2 * (t - tᵢ₋₁))
end
