
function γ(e, V)
    return 1 + e*cos(V)
end


function get_R(model)
   model.p₃/(1 + model.e₃*cos(model.V₃ᵢ₋₁))
end

function get_p_next(model)
   (; η, iᵢ₋₁, V₃ᵢ₋₁, Ωᵢ₋₁, ωᵢ₋₁, ω₃, eᵢ₋₁, pᵢ₋₁, m₁₂, m₃) = model

   Δp_2b = (128π/5*η*sqrt((m₁₂/pᵢ₋₁)^5))*(1 + 7/8*eᵢ₋₁^2)

   R = get_R(model)

   Δp_3b = if !iszero(m₃)
      (-15*π*(2*sin(2*iᵢ₋₁ - 2*ωᵢ₋₁) + 4*sin(2*ωᵢ₋₁) - 
              2*sin(2*(iᵢ₋₁ + ωᵢ₋₁)) + 4*sin(iᵢ₋₁ - 2*V₃ᵢ₋₁ - 2*ωᵢ₋₁ + 2*Ωᵢ₋₁ - 2*ω₃) + 
              4*sin(iᵢ₋₁ - 2*V₃ᵢ₋₁ + 2*ωᵢ₋₁ + 2*Ωᵢ₋₁ - 2*ω₃) - sin(2*(iᵢ₋₁ - V₃ᵢ₋₁ - ωᵢ₋₁ + Ωᵢ₋₁ - ω₃)) + 
              sin(2*(iᵢ₋₁ - V₃ᵢ₋₁ + ωᵢ₋₁ + Ωᵢ₋₁ - ω₃)) - 6*sin(2*(V₃ᵢ₋₁ - ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) - 
              sin(2*(iᵢ₋₁ + V₃ᵢ₋₁ - ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) + 6*sin(2*(V₃ᵢ₋₁ + ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) + 
              sin(2*(iᵢ₋₁ + V₃ᵢ₋₁ + ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) - 4*sin(iᵢ₋₁ + 2*V₃ᵢ₋₁ - 2*ωᵢ₋₁ - 2*Ωᵢ₋₁ + 2*ω₃) - 
              4*sin(iᵢ₋₁ + 2*V₃ᵢ₋₁ + 2*ωᵢ₋₁ - 2*Ωᵢ₋₁ + 2*ω₃)
             )*eᵢ₋₁^2*m₃*pᵢ₋₁^4
      )/(16m₁₂*R^3*sqrt(1 - eᵢ₋₁^2)^7)
   else
      0.0
   end

   return pᵢ₋₁*(1 - Δp_2b + Δp_3b)
end

function get_e_next(model)
   (; η, iᵢ₋₁, V₃ᵢ₋₁, Ωᵢ₋₁, ωᵢ₋₁, ω₃, eᵢ₋₁, pᵢ₋₁, m₁₂, m₃) = model

   R = get_R(model)

   Δe_2b = (608*π/15*η*sqrt((m₁₂/pᵢ₋₁)^5))*(1 + 121/304*eᵢ₋₁^2)

   Δe_3b = if !iszero(m₃)
      (15π*(2*sin(2*iᵢ₋₁ - 2*ωᵢ₋₁) + 4*sin(2*ωᵢ₋₁) - 
           2*sin(2*(iᵢ₋₁ + ωᵢ₋₁)) + 4*sin(iᵢ₋₁ - 2*V₃ᵢ₋₁ - 2*ωᵢ₋₁ + 2*Ωᵢ₋₁ - 2*ω₃) + 
           4*sin(iᵢ₋₁ - 2*V₃ᵢ₋₁ + 2*ωᵢ₋₁ + 2*Ωᵢ₋₁ - 2*ω₃) - sin(2*(iᵢ₋₁ - V₃ᵢ₋₁ - ωᵢ₋₁ + Ωᵢ₋₁ - ω₃)) + 
           sin(2*(iᵢ₋₁ - V₃ᵢ₋₁ + ωᵢ₋₁ + Ωᵢ₋₁ - ω₃)) - 6*sin(2*(V₃ᵢ₋₁ - ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) - 
           sin(2*(iᵢ₋₁ + V₃ᵢ₋₁ - ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) + 6*sin(2*(V₃ᵢ₋₁ + ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) + 
           sin(2*(iᵢ₋₁ + V₃ᵢ₋₁ + ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) - 4*sin(iᵢ₋₁ + 2*V₃ᵢ₋₁ - 2*ωᵢ₋₁ - 2*Ωᵢ₋₁ + 2*ω₃) - 
           4*sin(iᵢ₋₁ + 2*V₃ᵢ₋₁ + 2*ωᵢ₋₁ - 2*Ωᵢ₋₁ + 2*ω₃))*eᵢ₋₁*m₃*pᵢ₋₁^3)/(32m₁₂*R^3*sqrt(1 - eᵢ₋₁^2)^5)
   else
      0.0
   end

   return eᵢ₋₁*(1 -  Δe_2b + Δe_3b)
end


function get_Ω_next(model)
   (; iᵢ₋₁, V₃ᵢ₋₁, Ωᵢ₋₁, ω₃, ωᵢ₋₁, eᵢ₋₁, pᵢ₋₁, m₁₂, m₃) = model

   R = get_R(model)

   ΔΩ = if !iszero(m₃)
      (3π*sin(V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃)*(-8*cos(iᵢ₋₁)*sin(V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃) + 
       (6*sin(iᵢ₋₁ - V₃ᵢ₋₁ + Ωᵢ₋₁ - ω₃) - 5*sin(iᵢ₋₁ - V₃ᵢ₋₁ - 2*ωᵢ₋₁ + Ωᵢ₋₁ - ω₃) - 
        5*sin(iᵢ₋₁ - V₃ᵢ₋₁ + 2*ωᵢ₋₁ + Ωᵢ₋₁ - ω₃) - 6*sin(iᵢ₋₁ + V₃ᵢ₋₁ -  Ωᵢ₋₁ + ω₃) + 
        10*sin(V₃ᵢ₋₁ - 2*ωᵢ₋₁ - Ωᵢ₋₁ +  ω₃) + 5*sin(iᵢ₋₁ + V₃ᵢ₋₁ - 2*ωᵢ₋₁ - Ωᵢ₋₁ + ω₃) - 
        10*sin(V₃ᵢ₋₁ + 2*ωᵢ₋₁ - Ωᵢ₋₁ + ω₃) + 5*sin(iᵢ₋₁ + V₃ᵢ₋₁ + 2*ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)
       )*eᵢ₋₁^2)*m₃*pᵢ₋₁^3
      )/(8m₁₂*R^3*sqrt(1 - eᵢ₋₁^2)^7)
   else
      0.0
   end

   return Ωᵢ₋₁ + ΔΩ
end

function get_ω_next(model)
   (; iᵢ₋₁, V₃ᵢ₋₁, ωᵢ₋₁, Ωᵢ₋₁, ω₃, eᵢ₋₁, pᵢ₋₁, m₃, m₁₂) = model

   R = get_R(model)

   Δω = if !iszero(m₃) 
      (3*π*(12 + 20*cos(2*iᵢ₋₁) - 10*cos(2*iᵢ₋₁ - 2*ωᵢ₋₁) + 
       20cos(2*ωᵢ₋₁) - 10cos(2*(iᵢ₋₁ + ωᵢ₋₁)) - 
       20cos(iᵢ₋₁ - 2*V₃ᵢ₋₁ - 2*ωᵢ₋₁ + 2*Ωᵢ₋₁ - 2*ω₃) + 20cos(iᵢ₋₁ - 2*V₃ᵢ₋₁ + 2*ωᵢ₋₁ + 2*Ωᵢ₋₁ - 2*ω₃) - 
       10cos(2*(iᵢ₋₁ - V₃ᵢ₋₁ + Ωᵢ₋₁ - ω₃)) + 5cos(2*(iᵢ₋₁ - V₃ᵢ₋₁ - ωᵢ₋₁ + Ωᵢ₋₁ -  ω₃)) + 
       5cos(2*(iᵢ₋₁ - V₃ᵢ₋₁ + ωᵢ₋₁ + Ωᵢ₋₁ - ω₃)) + 4cos(2*(V₃ᵢ₋₁ - Ωᵢ₋₁ +  ω₃)) - 
       10cos(2*(iᵢ₋₁ + V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃)) + 30cos(2*(V₃ᵢ₋₁ - ωᵢ₋₁ - Ωᵢ₋₁ +  ω₃)) + 
       5cos(2*(iᵢ₋₁ + V₃ᵢ₋₁ - ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) + 30cos(2*(V₃ᵢ₋₁ + ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) + 
       5cos(2*(iᵢ₋₁ + V₃ᵢ₋₁ + ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) + 20cos(iᵢ₋₁ + 2*V₃ᵢ₋₁ - 2*ωᵢ₋₁ - 2*Ωᵢ₋₁ + 2*ω₃) - 
       20cos(iᵢ₋₁ + 2*V₃ᵢ₋₁ + 2*ωᵢ₋₁ - 2*Ωᵢ₋₁ + 2*ω₃) - 2*(-4 + 20cos(2*ωᵢ₋₁) - 
       5cos(iᵢ₋₁ - 2*V₃ᵢ₋₁ - 2*ωᵢ₋₁ + 2*Ωᵢ₋₁ - 2*ω₃) + 5cos(iᵢ₋₁ - 2*V₃ᵢ₋₁ + 2*ωᵢ₋₁ + 2*Ωᵢ₋₁ - 2*ω₃) + 
       12cos(2*(V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃)) + 10cos(2*(V₃ᵢ₋₁ - ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) + 
       10cos(2*(V₃ᵢ₋₁ + ωᵢ₋₁ - Ωᵢ₋₁ +  ω₃)) + 5cos(iᵢ₋₁ + 2*V₃ᵢ₋₁ - 2*ωᵢ₋₁ - 2*Ωᵢ₋₁ + 2*ω₃) - 
       5cos(iᵢ₋₁ + 2*V₃ᵢ₋₁ + 2*ωᵢ₋₁ - 2*Ωᵢ₋₁ + 2*ω₃))*
        eᵢ₋₁^2)*m₃*pᵢ₋₁^3)/(32*m₁₂*R^3*sqrt(1 - eᵢ₋₁^2)^7)
    else
      0.0
    end
   
   return ωᵢ₋₁ + Δω
end

function get_i_next(model)
   (; iᵢ₋₁, V₃ᵢ₋₁, Ωᵢ₋₁, ω₃, ωᵢ₋₁, eᵢ₋₁, pᵢ₋₁, m₃, m₁₂) = model

   R = get_R(model)

   Δi = if !iszero(m₃)
      (-3π*sin(iᵢ₋₁)*sin(V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃)*(8cos(V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃) + 
        (-5cos(iᵢ₋₁ - V₃ᵢ₋₁ - 2*ωᵢ₋₁ + Ωᵢ₋₁ - ω₃) + 5cos(iᵢ₋₁ - V₃ᵢ₋₁ + 2*ωᵢ₋₁ + Ωᵢ₋₁ - ω₃) + 
          12cos(V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃) + 10cos(V₃ᵢ₋₁ - 2*ωᵢ₋₁ - Ωᵢ₋₁ + ω₃) + 
          5cos(iᵢ₋₁ + V₃ᵢ₋₁ - 2*ωᵢ₋₁ -  Ωᵢ₋₁ +  ω₃) + 10cos(V₃ᵢ₋₁ + 2*ωᵢ₋₁ - Ωᵢ₋₁ +  ω₃) - 
          5cos(iᵢ₋₁ + V₃ᵢ₋₁ + 2*ωᵢ₋₁ -  Ωᵢ₋₁ +  ω₃)
         )*eᵢ₋₁^2)*m₃*pᵢ₋₁^3)/(8m₁₂*R^3*sqrt(1 - eᵢ₋₁^2)^7)
   else
      0.0
   end

   return iᵢ₋₁ + Δi
end

function get_V₃_next(model)
   (; V₃ᵢ₋₁, sqrt_Mp₃⁻³, e₃, t, tᵢ₋₁) = model

    return V₃ᵢ₋₁ + sqrt_Mp₃⁻³*γ(e₃, V₃ᵢ₋₁)^2*(t - tᵢ₋₁)
end

function get_t_next(model)
   (; iᵢ₋₁, Ωᵢ₋₁, ω₃, ωᵢ₋₁, eᵢ₋₁, pᵢ₋₁, m₃, η, m₁₂, V₃ᵢ₋₁) = model
   
   Acoeff = Utils.get_Acoeff(η, pᵢ₋₁, m₁₂, eᵢ₋₁)
   Bcoeff = Utils.get_Bcoeff(eᵢ₋₁)

   R = get_R(model)

   Δt_2b = 2π/√m₁₂*sqrt((pᵢ₋₁ + η*sqrt(m₁₂^5/pᵢ₋₁^3)*Acoeff) / 
                   (1 - eᵢ₋₁^2 + η*sqrt((m₁₂/pᵢ₋₁)^5)*Bcoeff))^3


   Δt_3b = if !iszero(m₃)
      -1/128*(π*sqrt(pᵢ₋₁^3/m₁₂)*
               (-768*m₁₂*R^3*eᵢ₋₁^4 + 256*m₁₂*R^3*eᵢ₋₁^6 + 3*eᵢ₋₁^2*
                  (256*m₁₂*R^3 - (20 + 60*cos(2*iᵢ₋₁) - 34*cos(2*iᵢ₋₁ - 2*ωᵢ₋₁) + 
                   68*cos(2*ωᵢ₋₁) - 34*cos(2*(iᵢ₋₁ + ωᵢ₋₁)) - 
                   68*cos(iᵢ₋₁ - 2*V₃ᵢ₋₁ - 2*ωᵢ₋₁ + 2*Ωᵢ₋₁ - 2*ω₃) + 
                   68*cos(iᵢ₋₁ - 2*V₃ᵢ₋₁ +  2*ωᵢ₋₁ +  2*Ωᵢ₋₁ -  2*ω₃) - 
                   30*cos(2*(iᵢ₋₁ - V₃ᵢ₋₁ +  Ωᵢ₋₁ -  ω₃)) + 
                   17*cos(2*(iᵢ₋₁ - V₃ᵢ₋₁ -  ωᵢ₋₁ +  Ωᵢ₋₁ -  ω₃)) + 
                   17*cos(2*(iᵢ₋₁ - V₃ᵢ₋₁ +  ωᵢ₋₁ +  Ωᵢ₋₁ -   ω₃)) + 
                   60*cos(2*(V₃ᵢ₋₁ -  Ωᵢ₋₁ +  ω₃)) - 
                   30*cos(2*(iᵢ₋₁ + V₃ᵢ₋₁ -  Ωᵢ₋₁ +  ω₃)) + 
                   102*cos(2*(V₃ᵢ₋₁ - ωᵢ₋₁ -  Ωᵢ₋₁ +  ω₃)) + 
                   17*cos(2*(iᵢ₋₁ + V₃ᵢ₋₁ -  ωᵢ₋₁ -  Ωᵢ₋₁ +  ω₃)) + 
                   102*cos(2*(V₃ᵢ₋₁ + ωᵢ₋₁ -  Ωᵢ₋₁ +  ω₃)) + 
                   17*cos(2*(iᵢ₋₁ + V₃ᵢ₋₁ +  ωᵢ₋₁ -  Ωᵢ₋₁ +  ω₃)) + 
                   68*cos(iᵢ₋₁ + 2*V₃ᵢ₋₁ -  2*ωᵢ₋₁ -  2*Ωᵢ₋₁ +  2*ω₃) - 
                   68*cos(iᵢ₋₁ + 2*V₃ᵢ₋₁ +  2*ωᵢ₋₁ -  2*Ωᵢ₋₁ +  2*ω₃))*m₃*pᵢ₋₁^3
                  ) - 
                8*(32*m₁₂*R^3 + (10 + 30*cos(2*iᵢ₋₁) - 
                   24*cos(2*iᵢ₋₁ - 2*ωᵢ₋₁) + 48*cos(2*ωᵢ₋₁) - 
                   24*cos(2*(iᵢ₋₁ + ωᵢ₋₁)) - 48*cos(iᵢ₋₁ - 2*V₃ᵢ₋₁ - 2*ωᵢ₋₁ + 2*Ωᵢ₋₁ - 2*ω₃) + 
                   48*cos(iᵢ₋₁ - 2*V₃ᵢ₋₁ + 2*ωᵢ₋₁ + 2*Ωᵢ₋₁ - 2*ω₃) - 
                   15*cos(2*(iᵢ₋₁ - V₃ᵢ₋₁ + Ωᵢ₋₁ - ω₃)) + 
                   12*cos(2*(iᵢ₋₁ - V₃ᵢ₋₁ - ωᵢ₋₁ + Ωᵢ₋₁ - ω₃)) + 
                   12*cos(2*(iᵢ₋₁ - V₃ᵢ₋₁ + ωᵢ₋₁ + Ωᵢ₋₁ - ω₃)) + 
                   30*cos(2*(V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃)) - 
                   15*cos(2*(iᵢ₋₁ + V₃ᵢ₋₁ - Ωᵢ₋₁ + ω₃)) + 
                   72*cos(2*(V₃ᵢ₋₁ - ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) + 
                   12*cos(2*(iᵢ₋₁ + V₃ᵢ₋₁ - ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) + 
                   72*cos(2*(V₃ᵢ₋₁ + ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) + 
                   12*cos(2*(iᵢ₋₁ + V₃ᵢ₋₁ + ωᵢ₋₁ - Ωᵢ₋₁ + ω₃)) + 
                   48*cos(iᵢ₋₁ + 2*V₃ᵢ₋₁ - 2*ωᵢ₋₁ - 2*Ωᵢ₋₁ + 2*ω₃) - 
                   48*cos(iᵢ₋₁ + 2*V₃ᵢ₋₁ + 2*ωᵢ₋₁ - 2*Ωᵢ₋₁ + 2*ω₃))*m₃*pᵢ₋₁^3
                  )
               )
            )/(m₁₂*R^3*sqrt(1 - eᵢ₋₁^2)^9)
   else
      1.0
   end

   # return model.tᵢ₋₁ + (Δt_2b + Δt_3b)
   return model.tᵢ₋₁ + (Δt_2b*Δt_3b)
   # return model.tᵢ₋₁ + (1 + Δt_2b + Δt_3b)
end

function get_V3_next(model)
    return model.V₃ᵢ₋₁ + model.sqrt_Mp₃⁻³*(γ(model.e₃, model.V₃ᵢ₋₁)^2*(model.t[end] - model.tᵢ₋₁))
end